/**
 * Description : TextConstants.ts - 📌 공통 UI 텍스트 ENUM 형식으로 상수 정의
 * Author : Shiwoo Min
 * Date : 2025-04-03
 */
export const TextConstants = {
  // GNB 메뉴 리스트
  GNB_LIST: [
    '모바일',
    '인터넷/IPTV',
    '마이페이지',
    '혜택/멤버십',
    '고객지원',
    '다이렉트샵',
    '유독',
  ],
  // 헤더 사이트 리스트
  HEADER_SITE_LIST: ['개인', '기업', '소상공인'],
  // GNB > 모바일 > 서브메인 리스트
  MOBILE_SUB_LIST: ['휴대폰', '요금제', '유심', '모델별 지원금', '해외로밍'],
  // GNB > 인터넷/IPTV > 서브메인 리스트
  INTERNET_SUB_LIST: ['맞춤상품찾기', '인터넷', 'IPTV', '스마트홈', '가입 사은품'],
  // GNB > 혜택/멤버십 > 서브메인 리스트
  BENEFIT_SIB_LIST: ['멤버십', '이벤트', '장기고객 혜택', '결합할인 혜택', '선택약정 할인'],
  // GNB > 모바일 > 휴대폰 사이드바
  MOBILE_SIDE_OPTION: ['가입 유형', '요금제', '제조사', '단말 유형', '저장용량', '할인 유형'],
  // GNB > 모바일 >
  BENEFIT: [
    '매장에서 받기',
    '7% 추가요금 할인',
    '다이렉트 요금제',
    '유심 가입',
    '결합할인',
    '제휴카드할인',
    '제휴팩',
  ],
};
